/*************************************************************************
【文件名】Teacher.cpp
【功能模块和目的】教师类的生成定义
【开发者及日期】邱亦文 2020-05-24
【版权信息】
【更改记录】2020-06-18 由邱亦文增加注释
*************************************************************************/
#include "teacher.h"


/*************************************************************************
【函数名称】Teacher::Teacher
【函数功能】按用户名、密码构造一个老师对象
【参数】入口参数，分别为用户名、密码
【返回值】构造函数不可有返回值
【开发者及日期】邱亦文 2020-5-24
【更改记录】
*************************************************************************/
Teacher::Teacher(const string& Name, const string& Password) : User(Name, Password, "Teacher")
{

}
